In [81]:
import pymongo
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt

In [82]:
df=pd.read_html("https://nepal.gov.np:8443/NationalPortal/view-page?id=140")[0]

In [83]:
df.head()

                       0                  1
0                   Name  Telephone Numbers
1         Nepal Eye Bank            4493684
2     Nepal Eye Hospital            4250691
3  Tilganga Eye Hospital            4423684
4           Bir Hospital    4223807/4221988

In [84]:
new_header = df.iloc[0]

In [85]:

df = df.rename(columns=new_header)

In [86]:

df = df.drop(df.index[0])
df.head()

                    Name Telephone Numbers
1         Nepal Eye Bank           4493684
2     Nepal Eye Hospital           4250691
3  Tilganga Eye Hospital           4423684
4           Bir Hospital   4223807/4221988
5  Nepal Police Hospital  4412430/44122530

In [87]:
name=df['Name']
number=df['Telephone Numbers']
d1=name.tolist()
d2=number.tolist()

In [88]:
contact_information1={
    'name':d1,
    'telno':d2
}

In [89]:
import json

In [92]:
with open("emergency_numberss.json","w") as outfile:
    json.dump(contact_information1,outfile)

In [93]:
from pymongo import MongoClient
import os

In [67]:
username = os.environ.get("MONGO_USERNAME")
password = os.environ.get("MONGO_PASSWORD")
db_name='emergency_contacts'

In [94]:
 client=pymongo.MongoClient("mongodb+srv://prabal:thisisnotacorrectpassword@ctrlaltdefeat.ylwdwgg.mongodb.net/")

In [95]:
db=client['emergency_contacts']
collection=db['name_and_contactno']

In [96]:
collection.insert_one(contact_information1)